bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_spp_misc.c
/*
 * Copyright (c) 2016-2022 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include <stdint.h>
#include <bl808_spp_misc.h>
#include <spp_misc_reg.h>

#define SPP_MISC_YUV_ADJUST_DEFAULT_Y_CONTRAST_MUL1   (862)
#define SPP_MISC_YUV_ADJUST_DEFAULT_Y_CONTRAST_MUL0   (896)
#define SPP_MISC_YUV_ADJUST_DEFAULT_Y_BRIGHTNESS      (0)

#define SPP_MISC_YUV_ADJUST_DEFAULT_UV_MAX            (240)
#define SPP_MISC_YUV_ADJUST_DEFAULT_UV_MIN            (16)
#define SPP_MISC_YUV_ADJUST_DEFAULT_Y_MAX             (235)
#define SPP_MISC_YUV_ADJUST_DEFAULT_Y_MIN             (16)

#define SPP_MISC_YUV_ADJUST_DEFAULT_UV_STURATION_MUL1 (903)
#define SPP_MISC_YUV_ADJUST_DEFAULT_UV_STURATION_MUL0 (896)

#define SPP_MISC_RESHAPE_TOGGLE_COUNT_MIN             (0)
#define SPP_MISC_RESHAPE_TOGGLE_COUNT_MAX             (32)

typedef enum {
    DISPLAY_INTR_SRC_TEST_SRC = 0,
    DISPLAY_INTR_SRC_OUTPUT = 1,
    DISPLAY_INTR_SRC_INVALID,
} SPP_Display_Intr_Src_Type;

static struct yuv2rgb_param_t g_bt601_yuv2rgb_cfg = {
    .pre_offset_0 = 0,
    .pre_offset_1 = -128,
    .pre_offset_2 = -128,
    .post_offset_0 = 0,
    .post_offset_1 = 0,
    .post_offset_2 = 0,
    .matrix_00 = 512,
    .matrix_01 = 0,
    .matrix_02 = 718,
    .matrix_10 = 512,
    .matrix_11 = -176,
    .matrix_12 = -366,
    .matrix_20 = 512,
    .matrix_21 = 907,
    .matrix_22 = 0
};

/****************************************************************************//**
 * @brief  DVP as 2x function init
 *
 * @param  dvp2xCfg: DVP as 2x configuration structure pointer
 *
 * @return None
 *
*******************************************************************************/
void SPP_MSIC_DVP_2x_Init(DVP_2x_Cfg_Type* dvp2xCfg)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DVP_ACTIVE_LEVEL_TYPE(dvp2xCfg->hSyncLevel));
    CHECK_PARAM(IS_DVP_ACTIVE_LEVEL_TYPE(dvp2xCfg->vSyncLevel));
    CHECK_PARAM(IS_DVP_DATA_ORDER_TYPE(dvp2xCfg->dataOrder));

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_DVPAS_HS_INV, dvp2xCfg->hSyncLevel);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_DVPAS_VS_INV, dvp2xCfg->vSyncLevel);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_DVPAS_DA_ORDER, dvp2xCfg->dataOrder);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_DVPAS_FIFO_TH, dvp2xCfg->fifoThreshold & 0x7ff);
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_CONFIG, tmpVal);

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(SEOF_INT0_IRQn,SEOF0_IRQHandler);
    Interrupt_Handler_Register(SEOF_INT1_IRQn,SEOF1_IRQHandler);
    Interrupt_Handler_Register(SEOF_INT2_IRQn,SEOF2_IRQHandler);
#endif
}

void SPP_MSIC_DVP_2x_Get_Cfg(DVP_2x_Cfg_Type* dvp2xCfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_CONFIG);
    dvp2xCfg->hSyncLevel = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DVPAS_HS_INV);
    dvp2xCfg->vSyncLevel = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DVPAS_VS_INV);
    dvp2xCfg->dataOrder = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DVPAS_DA_ORDER);
    dvp2xCfg->fifoThreshold = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DVPAS_FIFO_TH);
}

/****************************************************************************//**
 * @brief  DVP as 2x function enable
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void SPP_MSIC_DVP_2x_Enable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_CONFIG);
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_CONFIG, BL_SET_REG_BIT(tmpVal, SPP_MISC_RG_DVPAS_ENABLE));
}

/****************************************************************************//**
 * @brief  DVP as 2x function disable
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void SPP_MSIC_DVP_2x_Disable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_CONFIG);
    tmpVal = BL_CLR_REG_BIT(tmpVal,SPP_MISC_RG_DVPAS_ENABLE);
    BL_WR_REG(SPP_MISC_BASE,SPP_MISC_CONFIG,tmpVal);
}

void SPP_MSIC_DVP_2x_Get_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_CONFIG);
    if (BL_IS_REG_BIT_SET(tmpVal, SPP_MISC_RG_DVPAS_ENABLE)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}

void SPP_MSIC_Pclk_Force_Set_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_CONFIG);

