bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_spp_misc.c
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, SPP_MISC_REG_SPP_PCLK_FORCE_ON);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, SPP_MISC_REG_SPP_PCLK_FORCE_ON);
    }

    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_CONFIG, tmpVal);
}

void SPP_MSIC_Pclk_Force_Get_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_CONFIG);
    if (BL_IS_REG_BIT_SET(tmpVal, SPP_MISC_REG_SPP_PCLK_FORCE_ON)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}


/****************************************************************************/ /**
 * @brief  Select DVP TSRC data source
 *
 * @param  sourceType: DVP or CSI
 *
 * @return None
 *
*******************************************************************************/
void SPP_MISC_TSRC_Source_Select(SPP_MISC_TSRC_Source_Type sourceType)
{
    uint32_t tmpVal;
    
    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_PIX_DATA_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_SPP_DTSRC_SRC, sourceType);
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_PIX_DATA_CTRL, tmpVal);
}



void SPP_MSIC_Cr_De_As_Hsync_Set_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_CONFIG);

    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, SPP_MISC_CR_SPP_DE_AS_HSYNC);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, SPP_MISC_CR_SPP_DE_AS_HSYNC);
    }

    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_CONFIG, tmpVal);
}

void SPP_MSIC_Cr_De_As_Hsync_Get_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_CONFIG);
    if (BL_IS_REG_BIT_SET(tmpVal, SPP_MISC_CR_SPP_DE_AS_HSYNC)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}

void SPP_MSIC_Dtsrc_Set_Mode(SPP_DTSRC_SRC_E mode)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_PIX_DATA_CTRL);

    if (DVP_TSRC_SRC_MIPI_CSI == mode) {
        tmpVal = BL_SET_REG_BIT(tmpVal, SPP_MISC_REG_SPP_DTSRC_SRC);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, SPP_MISC_REG_SPP_DTSRC_SRC);
    }

    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_PIX_DATA_CTRL, tmpVal);
}

void SPP_MSIC_Dtsrc_Get_Mode(SPP_DTSRC_SRC_E *mode)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_PIX_DATA_CTRL);
    if (BL_IS_REG_BIT_SET(tmpVal, SPP_MISC_REG_SPP_DTSRC_SRC)) {
        *mode = DVP_TSRC_SRC_MIPI_CSI;
    } else {
        *mode = DVP_TSRC_SRC_DVP;
    }
}

void SPP_Misc_Config(SPP_DVP_BIT_DEPTH_E dvp_bits)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_CONFIG);
    tmpVal = BL_CLR_REG_BIT(tmpVal, SPP_MISC_CR_SPP_DE_AS_HSYNC);
#if (BL80X_HW_VER <= BL80X_HW_B0)
    //tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_NEW_AE_SEL, NEW_AE_STATS);
    //tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_NEW_RESERVEB_SEL, NEW_RESERVEB_STATS);
    /* select output of codec_scaler */
    tmpVal = BL_SET_REG_BIT(tmpVal, SPP_MISC_DVP_MUX_CH4_SEL);
#endif
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_CONFIG, tmpVal);

    /*
    Controls two MUXes:
        1. Selection signal of hdmi_dvp_tsrc sensor mode input
            0: From SPP scaler output
            1: From sensor
        2. Selection signal of HDMI data format
            0: {2'b0, dvp_test_src_data[15:0]} (for YUV422 data format)
            1: {2'b0, 8'd128, dvp_test_src_data[7:0]} (for Y-only data format)
    */


    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_PIX_DATA_CTRL);
    if (dvp_bits == SPP_DVP_10_BIT) {
#if (BL80X_HW_VER <= BL80X_HW_A0)
        /* 10 bit DVP sensor, wired to bit[2:11] of DVP interface */
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_PIX_DATA_CTRL, 0xFFC);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_PIX_DATA_SHT_BIT, 0x0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_PIX_DATA_SHT_DIR, 0x0);
#else
        /* 10 bit DVP sensor, wired to bit[0:9] of DVP interface */
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_PIX_DATA_CTRL, 0x3FF);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_PIX_DATA_SHT_BIT, 0x2);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_PIX_DATA_SHT_DIR, 0x0);
#endif
    } else {
        /* 12 bit DVP sensor, wired to bit[0:11] of DVP interface or
           10 bit DVP sensor, wired to bit[2:11] of DVP interface */
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_PIX_DATA_CTRL, 0xFFF);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_PIX_DATA_SHT_BIT, 0x0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_PIX_DATA_SHT_DIR, 0x0);
    }
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_PIX_DATA_CTRL, tmpVal);
}

void SPP_DVP2AXI_Set_Src(DVP2AXI_Port_Type dvp2axi, DVP2AXI_Src_Type src)
{
    uint32_t tmpVal;

    if (DVP2AXI_A == dvp2axi || DVP2AXI_B == dvp2axi \
        || DVP2AXI_C == dvp2axi || DVP2AXI_D == dvp2axi) {
        tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_DVP2BUS_SRC_SEL_1);

        switch (dvp2axi)
        {
        case DVP2AXI_A:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_D2B_DVP_SEL_A, src);
            break;
        case DVP2AXI_B:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_D2B_DVP_SEL_B, src);
            break;
        case DVP2AXI_C:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_D2B_DVP_SEL_C, src);
            break;
        case DVP2AXI_D:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_D2B_DVP_SEL_D, src);
            break;
        default:
            BL_ABORT();
        }
        BL_WR_REG(SPP_MISC_BASE, SPP_MISC_DVP2BUS_SRC_SEL_1, tmpVal);
    }
    else if (DVP2AXI_E == dvp2axi || DVP2AXI_F == dvp2axi \
        || DVP2AXI_G == dvp2axi || DVP2AXI_H == dvp2axi){
        tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_DVP2BUS_SRC_SEL_2);

        switch (dvp2axi)
        {
        case DVP2AXI_E:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_D2B_DVP_SEL_E, src);
            break;
        case DVP2AXI_F:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_D2B_DVP_SEL_F, src);
            break;
        case DVP2AXI_G:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_D2B_DVP_SEL_G, src);
            break;
        case DVP2AXI_H:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_D2B_DVP_SEL_H, src);
            break;
        default:
            BL_ABORT();
        }
        BL_WR_REG(SPP_MISC_BASE, SPP_MISC_DVP2BUS_SRC_SEL_2, tmpVal);
    }
    else {
        BL_ABORT();
    }
}

void SPP_DVP2AXI_Get_Src(DVP2AXI_Port_Type dvp2axi, DVP2AXI_Src_Type *src)
{
    uint32_t tmpVal;

    if (DVP2AXI_A == dvp2axi || DVP2AXI_B == dvp2axi \
        || DVP2AXI_C == dvp2axi || DVP2AXI_D == dvp2axi) {

