bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_spp_misc.c
#define YUV_SCALER_SET_CONFIG_MACRO(name) \
    {tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_SCALER##name##_I_SIZE);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_SCALER##name##_I_W, scaler_conf->input.width);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_SCALER##name##_I_H, scaler_conf->input.height);\
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_SCALER##name##_I_SIZE, tmpVal);\
    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_SCALER##name##_O_SIZE);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_SCALER##name##_O_W, scaler_conf->output.width);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_SCALER##name##_O_H, scaler_conf->output.height);\
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_SCALER##name##_O_SIZE, tmpVal);}

// TODO add interface to set scaler input, default is spp out
void SPP_Scaler_Set_Cfg(SPP_Scaler_Type type, SPP_SCALER_CONFIG_S *scaler_conf)
{
    uint32_t tmpVal;
    if (SPP_SCALER_A == type) {
        YUV_SCALER_SET_CONFIG_MACRO(A)
    } else if (SPP_SCALER_B == type) {
        YUV_SCALER_SET_CONFIG_MACRO(B)
    } else if (SPP_SCALER_C == type) {
        YUV_SCALER_SET_CONFIG_MACRO(C)
    } else if (SPP_SCALER_D == type) {
        YUV_SCALER_SET_CONFIG_MACRO(D)
    }
    else {
        printf("YUV Scaler not support!\r\n");
    }
}

void SPP_Frame_M_to_N(SPP_FRAME_M_TO_N_S *cfg)
{
    uint32_t frm_m_to_n;

    frm_m_to_n = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_DVP_FRAME_M_TO_N);
    frm_m_to_n = BL_SET_REG_BITS_VAL(frm_m_to_n, SPP_MISC_CR_FRAME_M_TO_N_EN, cfg->enb);
    frm_m_to_n = BL_SET_REG_BITS_VAL(frm_m_to_n, SPP_MISC_CR_FRAME_CNT_M, cfg->m);
    frm_m_to_n = BL_SET_REG_BITS_VAL(frm_m_to_n, SPP_MISC_CR_FRAME_CNT_N, cfg->n);
    frm_m_to_n = BL_SET_REG_BITS_VAL(frm_m_to_n, SPP_MISC_CR_FRAME_INTERVAL, cfg->intv);
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_DVP_FRAME_M_TO_N, frm_m_to_n);
}

void SPP_Frame_Get_M_to_N(SPP_FRAME_M_TO_N_S *cfg)
{
    uint32_t frm_m_to_n;

    frm_m_to_n = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_DVP_FRAME_M_TO_N);
    cfg->enb  = BL_GET_REG_BITS_VAL(frm_m_to_n, SPP_MISC_CR_FRAME_M_TO_N_EN);
    cfg->m    = BL_GET_REG_BITS_VAL(frm_m_to_n, SPP_MISC_CR_FRAME_CNT_M);
    cfg->n    = BL_GET_REG_BITS_VAL(frm_m_to_n, SPP_MISC_CR_FRAME_CNT_N);
    cfg->intv = BL_GET_REG_BITS_VAL(frm_m_to_n, SPP_MISC_CR_FRAME_INTERVAL);
}

void SPP_Enable_BL_SPP_Back(void)
{
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_DUMMY, 1);
}

#define YUV_ADJUST_INIT_MACRO(name) \
    {tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_0);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_Y_MUL0,  SPP_MISC_YUV_ADJUST_DEFAULT_Y_CONTRAST_MUL0);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_Y_MUL1,  SPP_MISC_YUV_ADJUST_DEFAULT_Y_CONTRAST_MUL1);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_Y_LUMA,  SPP_MISC_YUV_ADJUST_DEFAULT_Y_BRIGHTNESS);\
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_0, tmpVal);\
    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_1);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_UV_MAX,  SPP_MISC_YUV_ADJUST_DEFAULT_UV_MAX);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_UV_MIN,  SPP_MISC_YUV_ADJUST_DEFAULT_UV_MIN);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_Y_MAX,   SPP_MISC_YUV_ADJUST_DEFAULT_Y_MAX);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_Y_MIN,   SPP_MISC_YUV_ADJUST_DEFAULT_Y_MIN);\
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_1, tmpVal);\
    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_2);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_UV_MUL0,  SPP_MISC_YUV_ADJUST_DEFAULT_UV_STURATION_MUL0);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_UV_MUL1,  SPP_MISC_YUV_ADJUST_DEFAULT_UV_STURATION_MUL1);\
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_2, tmpVal);}

void SPP_YUV_Adjust_Init()
{
    uint32_t tmpVal;

    YUV_ADJUST_INIT_MACRO(A)
    YUV_ADJUST_INIT_MACRO(B)
    YUV_ADJUST_INIT_MACRO(C)
    YUV_ADJUST_INIT_MACRO(D)

    SPP_YUV_Adjust_Set_State(SPP_YUV_ADJUST_A, DISABLE);
    SPP_YUV_Adjust_Set_State(SPP_YUV_ADJUST_B, DISABLE);
    SPP_YUV_Adjust_Set_State(SPP_YUV_ADJUST_C, DISABLE);
    SPP_YUV_Adjust_Set_State(SPP_YUV_ADJUST_D, DISABLE);
}

#define YUV_ADJUST_SET_CFG_MACRO(name) \
    {tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_0);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_Y_MUL0,  cfg->y_mul0);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_Y_MUL1,  cfg->y_mul1);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_Y_LUMA,  cfg->y_luma);\
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_0, tmpVal);\
    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_1);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_UV_MAX,  cfg->uv_max);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_UV_MIN,  cfg->uv_min);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_Y_MAX,   cfg->y_max);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_Y_MIN,   cfg->y_min);\
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_1, tmpVal);\
    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_2);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_UV_MUL0,  cfg->uv_mul0);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_UV_MUL1,  cfg->uv_mul1);\
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_2, tmpVal);}

void SPP_YUV_Adjust_Set_Cfg(SPP_YUV_Adjust_Type type, SPP_YUV_Adjust_Cfg_Type *cfg)
{
    uint32_t tmpVal;

    if (SPP_YUV_ADJUST_A == type) {
        YUV_ADJUST_SET_CFG_MACRO(A)
    } else if (SPP_YUV_ADJUST_B == type) {
        YUV_ADJUST_SET_CFG_MACRO(B)
    } else if (SPP_YUV_ADJUST_C == type) {
        YUV_ADJUST_SET_CFG_MACRO(C)
    } else if (SPP_YUV_ADJUST_D == type) {
        YUV_ADJUST_SET_CFG_MACRO(D)
    }
    else {
        printf("YUV Adjust not support!\r\n");
    }

