bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_spp_misc.c
}

#define YUV_ADJUST_GET_CFG_MACRO(name) \
    {tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_0);\
    cfg->y_mul0 = BL_GET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_Y_MUL0);\
    cfg->y_mul1 = BL_GET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_Y_MUL1);\
    cfg->y_luma = BL_GET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_Y_LUMA);\
    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_1);\
    cfg->uv_max = BL_GET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_UV_MAX);\
    cfg->uv_min = BL_GET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_UV_MIN);\
    cfg->y_max = BL_GET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_Y_MAX);\
    cfg->y_min = BL_GET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_Y_MIN);\
    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_2);\
    cfg->uv_mul0 = BL_GET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_UV_MUL0);\
    cfg->uv_mul1 = BL_GET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_UV_MUL1);}

void SPP_YUV_Adjust_Get_Cfg(SPP_YUV_Adjust_Type type, SPP_YUV_Adjust_Cfg_Type *cfg)
{
    uint32_t tmpVal;

    if (SPP_YUV_ADJUST_A == type) {
        YUV_ADJUST_GET_CFG_MACRO(A)
    } else if (SPP_YUV_ADJUST_B == type) {
        YUV_ADJUST_GET_CFG_MACRO(B)
    } else if (SPP_YUV_ADJUST_C == type) {
        YUV_ADJUST_GET_CFG_MACRO(C)
    } else if (SPP_YUV_ADJUST_D == type) {
        YUV_ADJUST_GET_CFG_MACRO(D)
    }
    else {
        printf("YUV Adjust not support!\r\n");
    }

}

#define YUV_ADJUST_SET_STATE_MACRO(name) \
    {tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_0);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_ADJ_EB, state);\
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_0, tmpVal);}

void SPP_YUV_Adjust_Set_State(SPP_YUV_Adjust_Type type, BL_Fun_Type state)
{
    uint32_t tmpVal;
    if (SPP_YUV_ADJUST_A == type) {
        YUV_ADJUST_SET_STATE_MACRO(A)
    } else if (SPP_YUV_ADJUST_B == type) {
        YUV_ADJUST_SET_STATE_MACRO(B)
    } else if (SPP_YUV_ADJUST_C == type) {
        YUV_ADJUST_SET_STATE_MACRO(C)
    } else if (SPP_YUV_ADJUST_D == type) {
        YUV_ADJUST_SET_STATE_MACRO(D)
    }
    else {
        printf("YUV Adjust not support!\r\n");
    }
}

#define YUV_ADJUST_GET_STATE_MACRO(name) \
    {tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_0);\
    *state = BL_GET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_ADJ##name##_ADJ_EB);}

void SPP_YUV_Adjust_Get_State(SPP_YUV_Adjust_Type type, BL_Fun_Type *state)
{
    uint32_t tmpVal;
    if (SPP_YUV_ADJUST_A == type) {
        YUV_ADJUST_GET_STATE_MACRO(A)
    } else if (SPP_YUV_ADJUST_B == type) {
        YUV_ADJUST_GET_STATE_MACRO(B)
    } else if (SPP_YUV_ADJUST_C == type) {
        YUV_ADJUST_GET_STATE_MACRO(C)
    } else if (SPP_YUV_ADJUST_D == type) {
        YUV_ADJUST_GET_STATE_MACRO(D)
    }
    else {
        printf("YUV Adjust not support!\r\n");
    }
}

#define YUV_ADJUST_SET_INPUT_MACRO(name) \
    {tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_2);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_ADJ##name##_SEL, input);\
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_2, tmpVal);}

void SPP_YUV_Adjust_Set_Input(SPP_YUV_Adjust_Type type, SPP_YUV_Adjust_Input input)
{
    uint32_t tmpVal;
    if (SPP_YUV_ADJUST_A == type) {
        YUV_ADJUST_SET_INPUT_MACRO(A)
    } else if (SPP_YUV_ADJUST_B == type) {
        YUV_ADJUST_SET_INPUT_MACRO(B)
    } else if (SPP_YUV_ADJUST_C == type) {
        YUV_ADJUST_SET_INPUT_MACRO(C)
    } else if (SPP_YUV_ADJUST_D == type) {
        YUV_ADJUST_SET_INPUT_MACRO(D)
    }
    else {
        printf("YUV Adjust not support!\r\n");
    }
}

#define YUV_ADJUST_GET_INPUT_MACRO(name) \
    {tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_ADJ##name##_CTRL_2);\
    *input = BL_GET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_ADJ##name##_SEL);}

void SPP_YUV_Adjust_Get_Input(SPP_YUV_Adjust_Type type, SPP_YUV_Adjust_Input *input)
{
    uint32_t tmpVal;
    if (SPP_YUV_ADJUST_A == type) {
        YUV_ADJUST_GET_INPUT_MACRO(A)
    } else if (SPP_YUV_ADJUST_B == type) {
        YUV_ADJUST_GET_INPUT_MACRO(B)
    } else if (SPP_YUV_ADJUST_C == type) {
        YUV_ADJUST_GET_INPUT_MACRO(C)
    } else if (SPP_YUV_ADJUST_D == type) {
        YUV_ADJUST_GET_INPUT_MACRO(D)
    }
    else {
        printf("YUV Adjust not support!\r\n");
    }
}

#define SCALER_SET_INPUT_MACRO(name) \
    {tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_SCALER##name##_I_SIZE);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_SCALER##name##_SEL, input);\
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_SCALER##name##_I_SIZE, tmpVal);}

void SPP_Scaler_Set_Input(SPP_Scaler_Type type, SPP_Scaler_Input input)
{
    uint32_t tmpVal;
    if (SPP_SCALER_A == type) {
        SCALER_SET_INPUT_MACRO(A)
    } else if (SPP_SCALER_B == type) {
        SCALER_SET_INPUT_MACRO(B)
    } else if (SPP_SCALER_C == type) {
        SCALER_SET_INPUT_MACRO(C)
    } else if (SPP_SCALER_D == type) {
        SCALER_SET_INPUT_MACRO(D)
    } else {
        BL_LOGE("Scaler type %d not support!\r\n", type);
    }
}

#define SCALER_GET_INPUT_MACRO(name) \
    {tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_SCALER##name##_I_SIZE);\
    *input = BL_GET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_SCALER##name##_SEL);}
            
void SPP_Scaler_Get_Input(SPP_Scaler_Type type, SPP_Scaler_Input *input)
{
    uint32_t tmpVal;
    if (SPP_SCALER_A == type) {
        SCALER_GET_INPUT_MACRO(A)
    } else if (SPP_SCALER_B == type) {
        SCALER_GET_INPUT_MACRO(B)
    } else if (SPP_SCALER_C == type) {
        SCALER_GET_INPUT_MACRO(C)
    } else if (SPP_SCALER_D == type) {
        SCALER_GET_INPUT_MACRO(D)
    } else {
        BL_LOGE("Scaler type %d not support!\r\n", type);
    }
}

#define OSD_SET_INPUT_MACRO(name) \
    {tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_OSD##name##_I_CTRL);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_OSD##name##_SEL, input);\
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_OSD##name##_I_CTRL, tmpVal);}

void SPP_OSD_Set_Input(SPP_OSD_Type type, SPP_OSD_Input input)
{
    uint32_t tmpVal;
    if ((SPP_OSD_A == type || SPP_OSD_C == type) && (input == SPP_OSD_INPUT_OSD_A || input == SPP_OSD_INPUT_OSD_C)) {
        printf("Input from OsdA and OsdC are only supported by OsdB and OsdD\r\n");
        return;
    }
    if (SPP_OSD_A == type) {
        OSD_SET_INPUT_MACRO(A)
    } else if (SPP_OSD_B == type) {
        OSD_SET_INPUT_MACRO(B)
    } else if (SPP_OSD_C == type) {
        OSD_SET_INPUT_MACRO(C)
    } else if (SPP_OSD_D == type) {
        OSD_SET_INPUT_MACRO(D)
    } else {
        BL_LOGE("OSD type %d not support!\r\n", type);
    }
}

#define OSD_GET_INPUT_MACRO(name) \
    {tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_OSD##name##_I_CTRL);\
    *input = BL_GET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_OSD##name##_SEL);}

void SPP_OSD_Get_Input(SPP_OSD_Type type, SPP_OSD_Input *input)
{
    uint32_t tmpVal;
    if ((SPP_OSD_A == type || SPP_OSD_C == type) && (input == SPP_OSD_INPUT_OSD_A || input == SPP_OSD_INPUT_OSD_C)) {
        printf("Input from OsdA and OsdC are only supported by OsdB and OsdD\r\n");
        return;
    }
    if (SPP_OSD_A == type) {
        OSD_GET_INPUT_MACRO(A)
    } else if (SPP_OSD_B == type) {
        OSD_GET_INPUT_MACRO(B)
    } else if (SPP_OSD_C == type) {
        OSD_GET_INPUT_MACRO(C)
    } else if (SPP_OSD_D == type) {
        OSD_GET_INPUT_MACRO(D)
    } else {
        BL_LOGE("OSD type %d not support!\r\n", type);
    }
}

#define YUV2RGB_SET_INPUT_MACRO(name) \
    {tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_Y2R##name##_CONFIG_0);\
     tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2R##name##_SEL, (input == SPP_YUV2RGB_INPUT_DISABLED) ? 0 : input);\
     tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2R##name##_EN,  (input == SPP_YUV2RGB_INPUT_DISABLED) ? 0 : 1);\
     BL_WR_REG(SPP_MISC_BASE, SPP_MISC_Y2R##name##_CONFIG_0, tmpVal);}

void SPP_YUV2RGB_Set_Input(SPP_YUV2RGB_Type type, SPP_YUV2RGB_Input input)
{
    uint32_t tmpVal;

