bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_spp_misc.c
    if (SPP_YUV2RGB_A == type) {
        YUV2RGB_SET_INPUT_MACRO(A)
    } else {
        BL_LOGE("YUV2RGB type %d not support!\r\n", type);
    }
}

#define YUV2RGB_GET_INPUT_MACRO(name) \
    {tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_Y2R##name##_CONFIG_0);\
     *input = BL_GET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2R##name##_SEL);}

void SPP_YUV2RGB_Get_Input(SPP_YUV2RGB_Type type, SPP_YUV2RGB_Input *input)
{
    uint32_t tmpVal;

    if (SPP_YUV2RGB_A == type) {
        YUV2RGB_GET_INPUT_MACRO(A)
    } else {
        BL_LOGE("YUV2RGB type %d not support!\r\n", type);
    }
}

static void SPP_YUV2RGB_Set_Config(struct yuv2rgb_param_t *param)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_Y2RA_CONFIG_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2RA_PRE_0, param->pre_offset_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2RA_POS_0, param->post_offset_0);
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_Y2RA_CONFIG_0, tmpVal);

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_Y2RA_CONFIG_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2RA_PRE_1, param->pre_offset_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2RA_POS_1, param->post_offset_1);
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_Y2RA_CONFIG_1, tmpVal);

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_Y2RA_CONFIG_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2RA_PRE_2, param->pre_offset_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2RA_POS_2, param->post_offset_2);
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_Y2RA_CONFIG_2, tmpVal);

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_Y2RA_CONFIG_3);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2RA_MTX_00, param->matrix_00);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2RA_MTX_01, param->matrix_01);
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_Y2RA_CONFIG_3, tmpVal);

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_Y2RA_CONFIG_4);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2RA_MTX_02, param->matrix_02);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2RA_MTX_10, param->matrix_10);
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_Y2RA_CONFIG_4, tmpVal);

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_Y2RA_CONFIG_5);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2RA_MTX_11, param->matrix_11);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2RA_MTX_12, param->matrix_12);
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_Y2RA_CONFIG_5, tmpVal);

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_Y2RA_CONFIG_6);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2RA_MTX_20, param->matrix_20);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2RA_MTX_21, param->matrix_21);
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_Y2RA_CONFIG_6, tmpVal);

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_Y2RA_CONFIG_7);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_Y2RA_MTX_22, param->matrix_22);
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_Y2RA_CONFIG_7, tmpVal);

}

void SPP_YUV2RGB_Init(SPP_YUV2RGB_Param type)
{
    switch (type) {
        case SPP_YUV2RGB_PARAM_8BIT_BT601:
            SPP_YUV2RGB_Set_Config(&g_bt601_yuv2rgb_cfg);
            break;
        default:
            BL_LOGE("Unknown yuv2rgb type %d\r\n", type);
            break;
    }
}

/****************************************************************************//**
 * @brief  OSD input selection
 *
 * @param  osdId: OSD id
 * @param  inputType: OSD input type
 *
 * @return None
 *
*******************************************************************************/
void SPP_MISC_OSD_Input_Select(SPP_MISC_OSD_ID_Type osdId,SPP_MISC_OSD_Input_Type inputType)
{
    uint32_t tmpVal;
    uint32_t osdAddr = SPP_MISC_BASE+SPP_MISC_OSDA_I_CTRL_OFFSET+4*osdId;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_OSD_ID_TYPE(osdId));
    CHECK_PARAM(IS_SPP_MISC_OSD_INPUT_TYPE(inputType));

    tmpVal = BL_RD_WORD(osdAddr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_OSDA_SEL,inputType);
    BL_WR_WORD(osdAddr,tmpVal);
}

void SPP_MISC_OSD_Get_Input_Select(SPP_MISC_OSD_ID_Type osdId,SPP_MISC_OSD_Input_Type *inputType)
{
    uint32_t tmpVal;
    uint32_t osdAddr = SPP_MISC_BASE+SPP_MISC_OSDA_I_CTRL_OFFSET+4*osdId;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_OSD_ID_TYPE(osdId));
    CHECK_PARAM(IS_SPP_MISC_OSD_INPUT_TYPE(inputType));

    tmpVal = BL_RD_WORD(osdAddr);
    *inputType = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_OSDA_SEL);
}

void SPP_MISC_OSD_Pb_Input_Select(SPP_MISC_OSD_PB_Input_Type inputType)
{
    uint32_t tmpVal;
    
    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_OSD_PB_INPUT_TYPE(inputType));

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_OSDA_I_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_OSD_PB_SEL,inputType);
    BL_WR_REG(SPP_MISC_BASE,SPP_MISC_OSDA_I_CTRL,tmpVal);
}

void SPP_MISC_OSD_Pb_Get_Input_Select(SPP_MISC_OSD_PB_Input_Type *inputType)
{
    uint32_t tmpVal;
    
    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_OSD_PB_INPUT_TYPE(inputType));

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_OSDA_I_CTRL);
    *inputType = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_OSD_PB_SEL);
}

/****************************************************************************//**
 * @brief  Configure bayer data shift function
 *
 * @param  bitEnable: Enable bits used
 * @param  shiftType: Set shift direction
 * @param  bitShift: Set Shift bits
 *
 * @return None
 *
*******************************************************************************/
void SPP_MISC_Bayer_Shift(uint16_t bitEnable,SPP_MISC_Bayer_Shift_Type shiftType,uint8_t bitShift)
{
    uint32_t tmpVal = 0;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_BAYER_SHIFT_TYPE(shiftType));

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_REG_PIX_DATA_CTRL,bitEnable);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_REG_PIX_DATA_SHT_BIT,bitShift);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_REG_PIX_DATA_SHT_DIR,shiftType);
    BL_WR_REG(SPP_MISC_BASE,SPP_MISC_PIX_DATA_CTRL,tmpVal);
}

/****************************************************************************//**
 * @brief  YUV2RGB init
 *
 * @param  yuv2rgbId: YUV2RGB ID type
 * @param  yuv2rgbCfg: YUV2RGB configuration structure pointer
 *
 * @return None
 *
*******************************************************************************/
void SPP_MISC_YUV2RGB_Init(SPP_MISC_YUV2RGB_ID_Type yuv2rgbId,SPP_MISC_YUV2RGB_Cfg_Type* yuv2rgbCfg)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_YUV2RGB_ID_TYPE(yuv2rgbId));

    if(yuv2rgbId == SPP_MISC_YUV2RGB_DISPLAY_ID){
        tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_YUV_RGB_CONFIG_0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_Y2R_PRE_0,yuv2rgbCfg->preOffset0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_Y2R_PRE_1,yuv2rgbCfg->preOffset1);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_Y2R_PRE_2,yuv2rgbCfg->preOffset2);
        BL_WR_REG(SPP_MISC_BASE,SPP_MISC_DISP_YUV_RGB_CONFIG_0,tmpVal);

        tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_YUV_RGB_CONFIG_1);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_Y2R_POS_0,yuv2rgbCfg->postOffset0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_Y2R_POS_1,yuv2rgbCfg->postOffset1);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_Y2R_POS_2,yuv2rgbCfg->postOffset2);
        BL_WR_REG(SPP_MISC_BASE,SPP_MISC_DISP_YUV_RGB_CONFIG_1,tmpVal);

