bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_spp_misc.c
        /* Enable or disable function */
        tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_YUV_RGB_CONFIG_0);
        yuv2rgbCfg->enable = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_Y2R_EN);

    }else if(yuv2rgbId == SPP_MISC_YUV2RGB_NORMAL_ID){
        tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_Y2RA_CONFIG_0);
        yuv2rgbCfg->preOffset0 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_Y2RA_PRE_0);
        yuv2rgbCfg->postOffset0 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_Y2RA_POS_0);

        tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_Y2RA_CONFIG_1);
        yuv2rgbCfg->preOffset1 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_Y2RA_PRE_1);
        yuv2rgbCfg->postOffset1 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_Y2RA_POS_1);

        tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_Y2RA_CONFIG_2);
        yuv2rgbCfg->preOffset2 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_Y2RA_PRE_2);
        yuv2rgbCfg->postOffset2 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_Y2RA_POS_2);

        tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_Y2RA_CONFIG_3);
        yuv2rgbCfg->matrix00 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_Y2RA_MTX_00);
        yuv2rgbCfg->matrix01 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_Y2RA_MTX_01);

        tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_Y2RA_CONFIG_4);
        yuv2rgbCfg->matrix02 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_Y2RA_MTX_02);
        yuv2rgbCfg->matrix10 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_Y2RA_MTX_10);

        tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_Y2RA_CONFIG_5);
        yuv2rgbCfg->matrix11 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_Y2RA_MTX_11);
        yuv2rgbCfg->matrix12 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_Y2RA_MTX_12);

        tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_Y2RA_CONFIG_6);
        yuv2rgbCfg->matrix20 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_Y2RA_MTX_20);
        yuv2rgbCfg->matrix21 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_Y2RA_MTX_21);

        tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_Y2RA_CONFIG_7);
        yuv2rgbCfg->matrix22 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_Y2RA_MTX_22);

        tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_Y2RA_CONFIG_0);
        yuv2rgbCfg->enable = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_Y2RA_EN);
    }
}

/****************************************************************************//**
 * @brief  Scaler init
 *
 * @param  scalerId: Scaler id
 * @param  scalerCfg: Scaler configuration structure pointer
 *
 * @return None
 *
*******************************************************************************/
void SPP_MISC_Scaler_Init(SPP_MISC_Scaler_ID_Type scalerId,SPP_MISC_Scaler_Cfg_Type* scalerCfg)
{
    uint32_t tmpVal;
    uint32_t scalerAddr = SPP_MISC_BASE+SPP_MISC_SCALERA_I_SIZE_OFFSET+8*scalerId;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_SCALER_ID_TYPE(scalerId));

    tmpVal = BL_RD_WORD(scalerAddr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_SCALERA_I_W,scalerCfg->inputWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_SCALERA_I_H,(scalerCfg->inputHeight&0x7ff));
    BL_WR_WORD(scalerAddr,tmpVal);

    scalerAddr += 4;
    tmpVal = BL_RD_WORD(scalerAddr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_SCALERA_O_W,scalerCfg->outputWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_SCALERA_O_H,scalerCfg->outputHeight);
    BL_WR_WORD(scalerAddr,tmpVal);
}

/****************************************************************************//**
 * @brief  Scaler get cfg
 *
 * @param  scalerId: Scaler id
 * @param  scalerCfg: Scaler configuration structure pointer
 *
 * @return None
 *
*******************************************************************************/
void SPP_MISC_Scaler_Get_Cfg(SPP_MISC_Scaler_ID_Type scalerId,SPP_MISC_Scaler_Cfg_Type* scalerCfg)
{
    uint32_t tmpVal;
    uint32_t scalerAddr = SPP_MISC_BASE+SPP_MISC_SCALERA_I_SIZE_OFFSET+8*scalerId;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_SCALER_ID_TYPE(scalerId));

    tmpVal = BL_RD_WORD(scalerAddr);
    scalerCfg->inputWidth = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_SCALERA_I_W);
    scalerCfg->inputHeight = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_SCALERA_I_H);

    scalerAddr += 4;
    tmpVal = BL_RD_WORD(scalerAddr);
    scalerCfg->outputWidth = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_SCALERA_O_W);
    scalerCfg->outputHeight = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_SCALERA_O_H);
}

/****************************************************************************//**
 * @brief  Scaler input selection
 *
 * @param  scalerId: Scaler id
 * @param  inputType: Scaler input type
 *
 * @return None
 *
*******************************************************************************/
void SPP_MISC_Scaler_Input_Select(SPP_MISC_Scaler_ID_Type scalerId,SPP_MISC_Scaler_Input_Type inputType)
{
    uint32_t tmpVal;
    uint32_t scalerAddr = SPP_MISC_BASE+SPP_MISC_SCALERA_I_SIZE_OFFSET+8*scalerId;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_SCALER_ID_TYPE(scalerId));
    CHECK_PARAM(IS_SPP_MISC_SCALER_INPUT_TYPE(inputType));

    tmpVal = BL_RD_WORD(scalerAddr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_SCALERA_SEL,inputType);
    BL_WR_WORD(scalerAddr,tmpVal);
}

void SPP_MISC_Scaler_Get_Input_Select(SPP_MISC_Scaler_ID_Type scalerId,SPP_MISC_Scaler_Input_Type *inputType)
{
    uint32_t tmpVal;
    uint32_t scalerAddr = SPP_MISC_BASE+SPP_MISC_SCALERA_I_SIZE_OFFSET+8*scalerId;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_SCALER_ID_TYPE(scalerId));
    CHECK_PARAM(IS_SPP_MISC_SCALER_INPUT_TYPE(inputType));

    tmpVal = BL_RD_WORD(scalerAddr);
    *inputType = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_SCALERA_SEL);
}

/****************************************************************************//**
 * @brief  Scaler enable
 *
 * @param  scalerId: Scaler id
 *
 * @return None
 *
*******************************************************************************/
void SPP_MISC_Scaler_Enable(SPP_MISC_Scaler_ID_Type scalerId)
{
    uint32_t tmpVal;
    uint32_t scalerAddr = SPP_MISC_BASE+SPP_MISC_SCALERA_I_SIZE_OFFSET+8*scalerId;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_SCALER_ID_TYPE(scalerId));

