bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_spp_misc.c
    tmpVal = BL_RD_WORD(scalerAddr);
    tmpVal = BL_CLR_REG_BIT(tmpVal,SPP_MISC_RG_SCALERA_BYPASS);
    BL_WR_WORD(scalerAddr,tmpVal);
}

/****************************************************************************//**
 * @brief  Scaler disable
 *
 * @param  scalerId: Scaler id
 *
 * @return None
 *
*******************************************************************************/
void SPP_MISC_Scaler_Disable(SPP_MISC_Scaler_ID_Type scalerId)
{
    uint32_t tmpVal;
    uint32_t scalerAddr = SPP_MISC_BASE+SPP_MISC_SCALERA_I_SIZE_OFFSET+8*scalerId;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_SCALER_ID_TYPE(scalerId));

    tmpVal = BL_RD_WORD(scalerAddr);
    tmpVal = BL_SET_REG_BIT(tmpVal,SPP_MISC_RG_SCALERA_BYPASS);
    BL_WR_WORD(scalerAddr,tmpVal);
}

void SPP_MISC_Scaler_Get_State(SPP_MISC_Scaler_ID_Type scalerId, BL_Fun_Type *state)
{
    uint32_t tmpVal;
    uint32_t scalerAddr = SPP_MISC_BASE+SPP_MISC_SCALERA_I_SIZE_OFFSET+8*scalerId;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_SCALER_ID_TYPE(scalerId));

    tmpVal = BL_RD_WORD(scalerAddr);
    if (BL_IS_REG_BIT_SET(tmpVal, SPP_MISC_RG_SCALERA_BYPASS)) {
        *state = DISABLE;
    } else {
        *state = ENABLE;
    }
}

void SPP_MISC_Scaler_Sh_Enable(SPP_MISC_Scaler_ID_Type scalerId)
{
    uint32_t tmpVal;
    uint32_t scalerAddr = SPP_MISC_BASE+SPP_MISC_SCALERA_I_SIZE_OFFSET+8*scalerId;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_SCALER_ID_TYPE(scalerId));

    tmpVal = BL_RD_WORD(scalerAddr);
    tmpVal = BL_SET_REG_BIT(tmpVal,SPP_MISC_RG_SCLRB_SW_SH);
    BL_WR_WORD(scalerAddr,tmpVal);
}

void SPP_MISC_Scaler_Sh_Disable(SPP_MISC_Scaler_ID_Type scalerId)
{
    uint32_t tmpVal;
    uint32_t scalerAddr = SPP_MISC_BASE+SPP_MISC_SCALERA_I_SIZE_OFFSET+8*scalerId;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_SCALER_ID_TYPE(scalerId));

    tmpVal = BL_RD_WORD(scalerAddr);
    tmpVal = BL_CLR_REG_BIT(tmpVal,SPP_MISC_RG_SCLRB_SW_SH);
    BL_WR_WORD(scalerAddr,tmpVal);
}

/****************************************************************************//**
 * @brief  CAM input selection
 *
 * @param  camId: CAM id
 * @param  inputType: CAM input type
 *
 * @return None
 *
*******************************************************************************/
void SPP_MISC_CAM_Input_Select(SPP_MISC_CAM_ID_Type camId,SPP_MISC_CAM_Input_Type inputType)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_CAM_ID_TYPE(camId));
    CHECK_PARAM(IS_SPP_MISC_CAM_INPUT_TYPE(inputType));

    if(camId < SPP_MISC_CAM_4_ID){
        tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DVP2BUS_SRC_SEL_1);
        tmpVal = (tmpVal&~(0x3f<<(camId*8)))|(inputType&0x3f)<<(camId*8);
        BL_WR_REG(SPP_MISC_BASE,SPP_MISC_DVP2BUS_SRC_SEL_1,tmpVal);
    }else{
        camId -= 4;
        tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DVP2BUS_SRC_SEL_2);
        tmpVal = (tmpVal&~(0x3f<<(camId*8)))|(inputType&0x3f)<<(camId*8);
        BL_WR_REG(SPP_MISC_BASE,SPP_MISC_DVP2BUS_SRC_SEL_2,tmpVal);
    }
}

/****************************************************************************//**
 * @brief  Display init
 *
 * @param  displayCfg: Display configuration structure pointer
 *
 * @return None
 *
*******************************************************************************/
void SPP_MISC_Display_Init(SPP_MISC_Display_Cfg_Type* displayCfg)
{
    uint32_t tmpVal;

    /* Check the parameters */
    //CHECK_PARAM(IS_SPP_MISC_ADJUST_ID_TYPE(adjustId));
    //CHECK_PARAM(IS_SPP_MISC_DISPLAY_OSD_INPUT_TYPE(displayCfg->osdType));
    //CHECK_PARAM(IS_SPP_MISC_DISPLAY_INPUT_TYPE(displayCfg->inputType));

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_CONFIG);
    //tmpVal = BL_CLR_REG_BIT(tmpVal,SPP_MISC_RG_DISP_BT656_EN);//delet on excel
    tmpVal = BL_CLR_REG_BIT(tmpVal,SPP_MISC_RG_DISP_BT1120_EN);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_DPI_EN,displayCfg->dpiEnable);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_HDMI_EN,displayCfg->hdmiEnable);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_MUX_SEL,displayCfg->inputType);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_OSDDP_SEL,displayCfg->osdType);
    BL_WR_REG(SPP_MISC_BASE,SPP_MISC_DISP_CONFIG,tmpVal);

    if(displayCfg->bt1120Enable){
        tmpVal = BL_SET_REG_BIT(tmpVal,SPP_MISC_RG_DISP_BT1120_EN);
    }else{
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_BT656_EN,displayCfg->bt656Enable);
    }
    BL_WR_REG(SPP_MISC_BASE,SPP_MISC_DISP_CONFIG,tmpVal);

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_DPI_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_DPI_HS_W,displayCfg->hsyncWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_DPI_HFP_W,displayCfg->hfpWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_DPI_VS_W,displayCfg->vsyncWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_DPI_VFP_W,displayCfg->vfpWidth);
    BL_WR_REG(SPP_MISC_BASE,SPP_MISC_DISP_DPI_CONFIG,tmpVal);
}

void SPP_MISC_Display_Get_Cfg(SPP_MISC_Display_Cfg_Type* displayCfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_CONFIG);
    displayCfg->bt656Enable  = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_BT656_EN);
    displayCfg->bt1120Enable = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_BT1120_EN);
    displayCfg->dpiEnable   = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_DPI_EN);
    displayCfg->hdmiEnable  = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_HDMI_EN);
    displayCfg->inputType   = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_MUX_SEL);
    displayCfg->osdType     = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_OSDDP_SEL);

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_DPI_CONFIG);
    displayCfg->hsyncWidth  = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_DPI_HS_W);
    displayCfg->hfpWidth    = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_DPI_HFP_W);
    displayCfg->vsyncWidth  = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_DPI_VS_W);
    displayCfg->vfpWidth    = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_DPI_VFP_W);
}

void SPP_MISC_Display_Set_Clk_Output_Inv(int value)
{
    uint32_t tmpVal;
    
