bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_spp_misc.c
    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_CLKO_INV, value);

    BL_WR_REG(SPP_MISC_BASE,SPP_MISC_DISP_CONFIG,tmpVal);
}

void SPP_MISC_Display_Get_Clk_Output_Inv(int *value)
{
    uint32_t tmpVal;
    
    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_CONFIG);
    *value = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_CLKO_INV);
}

void SPP_MISC_Display_RGB2YUV_Set_Cfg(SPP_MISC_RGB2YUV_Cfg_Type* rgb2yuvCfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_PRE_0,rgb2yuvCfg->preOffset0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_PRE_1,rgb2yuvCfg->preOffset1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_PRE_2,rgb2yuvCfg->preOffset2);
    BL_WR_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_0,tmpVal);

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_POS_0,rgb2yuvCfg->postOffset0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_POS_1,rgb2yuvCfg->postOffset1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_POS_2,rgb2yuvCfg->postOffset2);
    BL_WR_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_1,tmpVal);

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_00,rgb2yuvCfg->matrix00);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_01,rgb2yuvCfg->matrix01);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_02_L,(rgb2yuvCfg->matrix02 & 0xf));
    BL_WR_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_2,tmpVal);

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_3);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_02_U,(rgb2yuvCfg->matrix02>>8));
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_10,rgb2yuvCfg->matrix10);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_11,rgb2yuvCfg->matrix11);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_12_L,(rgb2yuvCfg->matrix12 & 0x3));
    BL_WR_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_3,tmpVal);

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_4);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_12_U,(rgb2yuvCfg->matrix12>>4));
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_20,rgb2yuvCfg->matrix20);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_21,rgb2yuvCfg->matrix21);
    BL_WR_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_4,tmpVal);

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_5);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_22,rgb2yuvCfg->matrix22);
    BL_WR_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_5,tmpVal);

    /* Enable or disable function */
    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_0);
    BL_WR_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_0,BL_SET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_EN,rgb2yuvCfg->enable));

}

void SPP_MISC_Display_RGB2YUV_Get_Cfg(SPP_MISC_RGB2YUV_Cfg_Type* rgb2yuvCfg)
{
    uint32_t tmpVal;
    uint16_t temp_mtx_l, temp_mtx_u;

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_0);
    rgb2yuvCfg->preOffset0 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_PRE_0);
    rgb2yuvCfg->preOffset1 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_PRE_1);
    rgb2yuvCfg->preOffset2 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_PRE_2);

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_1);
    rgb2yuvCfg->postOffset0 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_POS_0);
    rgb2yuvCfg->postOffset1 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_POS_1);
    rgb2yuvCfg->postOffset2 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_POS_2);

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_2);
    rgb2yuvCfg->matrix00 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_00);
    rgb2yuvCfg->matrix01 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_01);
    temp_mtx_l = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_02_L);

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_3);
    temp_mtx_u = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_02_U);
    rgb2yuvCfg->matrix02 = (temp_mtx_u << 8) + temp_mtx_l;
    
    rgb2yuvCfg->matrix10 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_10);
    rgb2yuvCfg->matrix11 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_11);
    temp_mtx_l = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_12_L);

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_4);
    temp_mtx_u = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_12_U);
    rgb2yuvCfg->matrix12 = (temp_mtx_u << 4) + temp_mtx_l;
    
    rgb2yuvCfg->matrix20 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_20);
    rgb2yuvCfg->matrix21 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_21);

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_5);
    rgb2yuvCfg->matrix22 = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_MTX_22);

    /* Enable or disable function */
    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_DISP_RGB2YUV_CONFIG_0);
    rgb2yuvCfg->enable = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_RG_DISP_R2Y_EN);
}

/****************************************************************************//**
 * @brief  Crop init
 *
 * @param  cropId: Crop id
 * @param  cropCfg: Crop configuration structure pointer
 *
 * @return None
 *
*******************************************************************************/
void SPP_MISC_Crop_Init(SPP_MISC_Crop_ID_Type cropId, SPP_MISC_Crop_Cfg_Type* cropCfg)
{
    uint32_t cropAddr = SPP_MISC_BASE+SPP_MISC_CROPA_HSYNC_OFFSET+8*cropId;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_CROP_ID_TYPE(cropId));

