bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_spp_misc.c
    BL_WR_WORD(cropAddr,cropCfg->hsyncEnd<<16|cropCfg->hsyncStart);
    cropAddr += 4;
    BL_WR_WORD(cropAddr,cropCfg->vsyncEnd<<16|cropCfg->vsyncStart);
}

void SPP_MISC_Crop_Get_Cfg(SPP_MISC_Crop_ID_Type cropId, SPP_MISC_Crop_Cfg_Type* cropCfg)
{
    uint32_t tmpVal;
    uint32_t cropAddr = SPP_MISC_BASE+SPP_MISC_CROPA_HSYNC_OFFSET+8*cropId;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_CROP_ID_TYPE(cropId));

    tmpVal = BL_RD_WORD(cropAddr);
    cropCfg->hsyncStart = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_REG_CROPA_HSYNC_START);
    cropCfg->hsyncEnd = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_REG_CROPA_HSYNC_END);

    cropAddr += 4;
    tmpVal = BL_RD_WORD(cropAddr);
    cropCfg->vsyncStart = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_REG_CROPA_VSYNC_START);
    cropCfg->vsyncEnd = BL_GET_REG_BITS_VAL(tmpVal,SPP_MISC_REG_CROPA_VSYNC_END);
}

/****************************************************************************//**
 * @brief  Crop enable
 *
 * @param  cropId: Crop id
 *
 * @return None
 *
*******************************************************************************/
void SPP_MISC_Crop_Enable(SPP_MISC_Crop_ID_Type cropId)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_CROP_ID_TYPE(cropId));

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_CROP_ENABLE);
    switch(cropId){
        case SPP_MISC_CROP_0_ID:
            tmpVal = BL_SET_REG_BIT(tmpVal,SPP_MISC_REG_CROPA_ENABLE);
            break;
        case SPP_MISC_CROP_1_ID:
            tmpVal = BL_SET_REG_BIT(tmpVal,SPP_MISC_REG_CROPB_ENABLE);
            break;
        case SPP_MISC_CROP_2_ID:
            tmpVal = BL_SET_REG_BIT(tmpVal,SPP_MISC_REG_CROPC_ENABLE);
            break;
        case SPP_MISC_CROP_3_ID:
            tmpVal = BL_SET_REG_BIT(tmpVal,SPP_MISC_REG_CROPD_ENABLE);
            break;
        default:
            break;
    }
    BL_WR_REG(SPP_MISC_BASE,SPP_MISC_CROP_ENABLE,tmpVal);
}

/****************************************************************************//**
 * @brief  Crop disable
 *
 * @param  cropId: Crop id
 *
 * @return None
 *
*******************************************************************************/
void SPP_MISC_Crop_Disable(SPP_MISC_Crop_ID_Type cropId)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_CROP_ID_TYPE(cropId));

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_CROP_ENABLE);
    switch(cropId){
        case SPP_MISC_CROP_0_ID:
            tmpVal = BL_CLR_REG_BIT(tmpVal,SPP_MISC_REG_CROPA_ENABLE);
            break;
        case SPP_MISC_CROP_1_ID:
            tmpVal = BL_CLR_REG_BIT(tmpVal,SPP_MISC_REG_CROPB_ENABLE);
            break;
        case SPP_MISC_CROP_2_ID:
            tmpVal = BL_CLR_REG_BIT(tmpVal,SPP_MISC_REG_CROPC_ENABLE);
            break;
        case SPP_MISC_CROP_3_ID:
            tmpVal = BL_CLR_REG_BIT(tmpVal,SPP_MISC_REG_CROPD_ENABLE);
            break;
        default:
            break;
    }
    BL_WR_REG(SPP_MISC_BASE,SPP_MISC_CROP_ENABLE,tmpVal);
}

void SPP_MISC_Crop_Get_State(SPP_MISC_Crop_ID_Type cropId, BL_Fun_Type *state)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_CROP_ID_TYPE(cropId));

    tmpVal = BL_RD_REG(SPP_MISC_BASE,SPP_MISC_CROP_ENABLE);
    switch(cropId){
        case SPP_MISC_CROP_0_ID:
            if (BL_IS_REG_BIT_SET(tmpVal, SPP_MISC_REG_CROPA_ENABLE)) {
                *state = ENABLE;
            } else {
                *state = DISABLE;
            }
            break;
        case SPP_MISC_CROP_1_ID:
            if (BL_IS_REG_BIT_SET(tmpVal, SPP_MISC_REG_CROPB_ENABLE)) {
                *state = ENABLE;
            } else {
                *state = DISABLE;
            }
            break;
        case SPP_MISC_CROP_2_ID:
            if (BL_IS_REG_BIT_SET(tmpVal, SPP_MISC_REG_CROPC_ENABLE)) {
                *state = ENABLE;
            } else {
                *state = DISABLE;
            }
            break;
        case SPP_MISC_CROP_3_ID:
            if (BL_IS_REG_BIT_SET(tmpVal, SPP_MISC_REG_CROPD_ENABLE)) {
                *state = ENABLE;
            } else {
                *state = DISABLE;
            }
            break;
        default:
            break;
    }
}

void SPP_MISC_Reshape_Set_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_DVP_RESHAPE);

    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, SPP_MISC_REG_RSHP_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, SPP_MISC_REG_RSHP_EN);
    }

    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_DVP_RESHAPE, tmpVal);
}

void SPP_MISC_Reshape_Get_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_DVP_RESHAPE);
    if (BL_IS_REG_BIT_SET(tmpVal, SPP_MISC_REG_RSHP_EN)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}

void SPP_MISC_Reshape_Counter_Clear()
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_DVP_RESHAPE);
    tmpVal = BL_SET_REG_BIT(tmpVal, SPP_MISC_REG_RSHP_CLR);
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_DVP_RESHAPE, tmpVal);
}

void SPP_MISC_Reshape_Set_Counter(int value)
{
    uint32_t tmpVal;

    CHECK_PARAM_RANGE(value, SPP_MISC_RESHAPE_TOGGLE_COUNT_MIN, SPP_MISC_RESHAPE_TOGGLE_COUNT_MAX);

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_DVP_RESHAPE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_RSHP_TGL_COUNT, value);
    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_DVP_RESHAPE, tmpVal);
}

void SPP_MISC_Reshape_Get_Counter(int *value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_DVP_RESHAPE);
    *value = BL_GET_REG_BITS_VAL(tmpVal, SPP_MISC_REG_RSHP_TGL_COUNT);
}

void SPP_MISC_Reshape_Set_HSync_Inv(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_DVP_RESHAPE);

    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, SPP_MISC_REG_RSHP_HSYNC_INV);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, SPP_MISC_REG_RSHP_HSYNC_INV);
    }

    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_DVP_RESHAPE, tmpVal);
}

void SPP_MISC_Reshape_Get_HSync_Inv(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_DVP_RESHAPE);

    if (BL_IS_REG_BIT_SET(tmpVal, SPP_MISC_REG_RSHP_HSYNC_INV)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}

void SPP_MISC_Reshape_Set_VSync_Inv(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_DVP_RESHAPE);

