bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_spp_misc.c
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, SPP_MISC_REG_RSHP_VSYNC_INV);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, SPP_MISC_REG_RSHP_VSYNC_INV);
    }

    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_DVP_RESHAPE, tmpVal);
}

void SPP_MISC_Reshape_Get_VSync_Inv(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_DVP_RESHAPE);

    if (BL_IS_REG_BIT_SET(tmpVal, SPP_MISC_REG_RSHP_VSYNC_INV)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }

}


/****************************************************************************/ /**
 * @brief  Select SEOF interrupt vsync source
 *
 * @param  intType: SEOF interrupt type
 * @param  source: SEOF interrupt vsync source type
 *
 * @return None
 *
*******************************************************************************/
void SPP_MISC_SEOF_Set_Source(SPP_MISC_INT_Type intType, SPP_MISC_SEOF_Source_Type source)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_INT_TYPE(intType));
    CHECK_PARAM(IS_SPP_MISC_SEOF_SOURCE_TYPE(source));

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_INT_CTRL);

    switch (intType) {
        case SPP_MISC_INT_SEOF0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_SEOF1_INT_SRC, source);
            break;

        case SPP_MISC_INT_SEOF1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_SEOF2_INT_SRC, source);
            break;

        case SPP_MISC_INT_SEOF2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_SEOF3_INT_SRC, source);
            break;

        case SPP_MISC_INT_DISPLAY:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_DP_SEOF0_INT_SRC, source & 0x1);
            break;

        case SPP_MISC_INT_SEOF3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_SEOF4_INT_SRC, source);
            break;

        default:
            return;
            break;
    }

    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_INT_CTRL, tmpVal);
}


/****************************************************************************/ /**
 * @brief  Select SEOF interrupt vsync source
 *
 * @param  intType: SEOF interrupt type
 * @param  edge: SEOF interrupt edge type
 *
 * @return None
 *
*******************************************************************************/
void SPP_MISC_SEOF_Set_Edge(SPP_MISC_INT_Type intType, SPP_MISC_SEOF_Edge_Type edge)
{
    uint32_t tmpVal;

    /* Check the parameters */
    // CHECK_PARAM(IS_SPP_MISC_INT_TYPE(intType));
    // CHECK_PARAM(IS_SPP_MISC_SEOF_EDGE_TYPE(edge));

    tmpVal = BL_RD_REG(SPP_MISC_BASE, SPP_MISC_INT_CTRL);

    switch (intType) {
        case SPP_MISC_INT_SEOF0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_SEOF1_INT_EDGE, edge);
            break;

        case SPP_MISC_INT_SEOF1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_SEOF2_INT_EDGE, edge);
            break;

        case SPP_MISC_INT_SEOF2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_SEOF3_INT_EDGE, edge);
            break;

        case SPP_MISC_INT_DISPLAY:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_DP_SEOF0_INT_EDGE, edge);
            break;

        case SPP_MISC_INT_SEOF3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPP_MISC_RG_SEOF4_INT_EDGE, edge);
            break;

        default:
            return;
            break;
    }

    BL_WR_REG(SPP_MISC_BASE, SPP_MISC_INT_CTRL, tmpVal);
}
/** @defgroup  SPP_MISC_Private_Variables
 *  @{
 */
//#ifndef BFLB_USE_HAL_DRIVER
static intCallback_Type *sppMiscIntCbfArra[SPP_MISC_INT_ALL] = {
    NULL
};
//#endif

/****************************************************************************/ /**
 * @brief  Display interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
//#ifndef BFLB_USE_HAL_DRIVER
void Display_IRQHandler(void)
{
    SPP_MISC_Int_Clear_1(SPP_MISC_INT_DISPLAY);

    if (sppMiscIntCbfArra[SPP_MISC_INT_DISPLAY] != NULL) {
        sppMiscIntCbfArra[SPP_MISC_INT_DISPLAY]();
    }
}
//#endif
#if 1

/****************************************************************************/ /**
 * @brief  Install spp misc interrupt callback function
 *
 * @param  intType: ISP misc interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return None
 *
*******************************************************************************/
//#ifndef BFLB_USE_HAL_DRIVER
void SPP_MISC_Int_Callback_Install(SPP_MISC_INT_Type intType, intCallback_Type *cbFun)
{
    /* Check the parameters */
    CHECK_PARAM(IS_SPP_MISC_INT_TYPE(intType));

    switch (intType) {
        case SPP_MISC_INT_DISPLAY:
            Interrupt_Handler_Register(DISPLAY_IRQn, Display_IRQHandler);
            break;
        default:
            break;
    }

    sppMiscIntCbfArra[intType] = cbFun;
}
#endif
//#endif
